import { atom } from "recoil";
import mainImage from "../../assets/images/الاسرة والحياة رئيسي.png";

const articlesState = atom({
  key: "articlesState",
  default: [
    {
      title: "عنقود طمّني",
      description:
        "بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا. بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا. بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا...",
      imgSrc: mainImage,
      link: "/Article",
    },
    {
      title: "عنقود طمّني",
      description:
        "بعض النصوص التوضيحية هنا...  بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا.  بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا.",
      imgSrc: mainImage,
      link: "/Article",
    },
    {
      title: "عنقود طمّني",
      description: "بعض النصوص التوضيحية هنا...",
      imgSrc: mainImage,
      link: "/Article",
    },
    {
      title: "عنقود طمّني",
      description: "بعض النصوص التوضيحية هنا...",
      imgSrc: mainImage,
      link: "/Article",
    },
  ],
});

export default articlesState;
