import React from "react";
import { DOCTRINAL_EDUCATION } from "../assets/utils/Constants";
import mainImage from "../assets/images/الاسرة والحياة رئيسي.png";
import SubjectTemplate from "../component/templates/SubjectTemplate";

const DoctrinalEducation = () => {
  const categories = [
    "أسئلة الأبناء العقائدية",
    "الأقصى عقيدة",
    "التربية بالأذكار",
    "أحسن القصص",
    "أسماء الله الحسنى",
    "الرموز و التمائم",
    "الشركات المعاصرة",
    "غرس عقيدة الأبناء",
  ];

  const articles = [
    {
      title: "عنقود طمّني",
      description:
        "بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا. بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا. بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا...",
      img: mainImage,
    },
    {
      title: "عنقود طمّني",
      description:
        "بعض النصوص التوضيحية هنا...  بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا.  بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا.",
      img: mainImage,
    },
    {
      title: "عنقود طمّني",
      description: "بعض النصوص التوضيحية هنا...",
      img: mainImage,
    },
    {
      title: "عنقود طمّني",
      description: "بعض النصوص التوضيحية هنا...",
      img: mainImage,
    },
  ];

  return (
    <SubjectTemplate
      categories={categories}
      title={DOCTRINAL_EDUCATION}
      articles={articles}
      category={DOCTRINAL_EDUCATION}
    />
  );
};

export default DoctrinalEducation;
