import React from "react";
import SubjectPage from "../component/SubjectPage";
import { RAISING } from "../assets/utils/Constants";
import mainImage from "../assets/images/الاسرة والحياة رئيسي.png";

const Raising = () => {
  const categories = [
    "إضاءات تربوية",
    "من الوحيين",
    "التربية بالقصة",
    "يا بني اركب معنا",
    "المباح من الكلام في التربية الجنسية في الإسلام",
    "حياتنا والشاشات",
  ];

  const articles = [
    {
      title: "عنقود طمّني",
      description:
        "بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا. بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا. بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا...",
      img: mainImage,
    },
    {
      title: "عنقود طمّني",
      description:
        "بعض النصوص التوضيحية هنا...  بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا.  بعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هنبعض النصوص التوضيحية هن بعض النصوص التوضيحية هنا.",
      img: mainImage,
    },
    {
      title: "عنقود طمّني",
      description: "بعض النصوص التوضيحية هنا...",
      img: mainImage,
    },
    {
      title: "عنقود طمّني",
      description: "بعض النصوص التوضيحية هنا...",
      img: mainImage,
    },
  ];

  return (
    <SubjectPage
      categories={categories}
      title={RAISING}
      articles={articles}
      category={RAISING}
    />
  );
};

export default Raising;
