import ArticleTemplate from "../templates/ArticleTemplate";
import { DOCTRINAL_EDUCATION } from "../../assets/utils/Constants";
import mainImage from "../../assets/images/التربية العقائدية مقال.png";

const ArticleTest = () => {
  const articleTitle = "تهيئة ابني لمرحلة البلوغ";
  const articleContent = [
    "من يتكلم مع الولد؟ ومتى نتكلم؟",
    "بسبب غياب الكثير من الآباء سواء بإرادتهم أو بغير إرادتهم عن تربية الصبيان، تنمو حواجز نفسية من الخجل بينهم، وقد يكون الأب حاضرا لكنه يتخيل أن تلك الأمور لا تحتاج لمعرفة، فيظن أن ابنه سيعرف كل شيء بمفرده، كيف؟ هذه ليست قضيته.",
    "مع الأسف لأن الأم في زماننا تقوم بكل الأدوار التربوية وحدها، وتقضي مع الصبيان والبنات غالب وقتها فتنمو الصداقة بينهم وتنهار حواجز البعد النفسي والخجل.",
    "فإذا استطاعت الأم أن تقنع الأب بضرورة أن يهيئ الصبي لمرحلة البلوغ، ونجحت في جعل ابنها يسأل والده، مع توصية الأب أن يتقبل الأسئلة ويجيب بصدر رحب ولا يُحرج الصبي؛ فهذا أمر طيب.",
    "في غياب الأب يمكنك طلب المساعدة من محارمك للقيام بهذا الدور، أو طلب ذلك ممن يُستأمن من معلميه.",
    "فإن تعذر كل ما سبق فلتشمر هي، لتحافظ على ابنها من أصدقاء السوء ومعلوماتهم المضللة أو من الخوض في وحل البحث على الانترنت، فالمعرفة ضرورية والحاجة ملحة ولن يقف الولد مكتوف الأيدي أمام صمتكما.",
    "أضعف الإيمان أن تعطي الأم كتيبات، أو مقالات لابنها كي يقرأها.",
    "لابد أن يكون الوالدان هما المصدر الأول الموثوق به للمعلومات في هذا الأمر.",
    "إذا سأل الابن سؤالا لا تملكون له جوابا، اطلبوا منه مهلة لتبحثوا عن الإجابة، وأخبروه أن المعلومات على الانترنت قد تكون خاطئة ومضللة، وقد يكون فيها مبالغات تشعر من يقرأها أنه ليس طبيعيا، لذا ستسألون أهل الثقات وتجيبونه.",
    "من تجارب الكثيرات فالأمر في بدايته فقط يكون مخجلا، ثم يأخذ صبغة الموضوعية، حيث نتكلم عن حقائق مجردة من طبائع الأمور، فيتلاشى الحرج، وتتضاعف مقدار علاقة الصداقة بينهما.",
    "التهيئة لمرحلة البلوغ تكون تدريجية، لا يصح أن نقول كل شيء في جلسة واحدة، لكيلا تتشوش أفكاره.",
    "إذا بدأ الطفل بسؤالك، فلا تنهريه أو توبخيه وتمنعيه من الكلام في هذه الأمور.",
  ];
  return (
    <ArticleTemplate
      category={DOCTRINAL_EDUCATION}
      subcategory={"عقيدة طفلي"}
      imgSrc={mainImage}
      title={articleTitle}
      content={articleContent}
      publishTime={"22 اغسطس 2024"}
    />
  );
};

export default ArticleTest;
